// Copyright 2012 the V8 project authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

// Platform-specific code for zOS/Unix goes here. For the POSIX-compatible
// parts, the implementation is in platform-posix.cc.
#if !defined(_AE_BIMODAL)
#define _AE_BIMODAL 1
#endif

#include <pthread.h>
#include <signal.h>
#include <stdlib.h>
#include <sys/resource.h>
#include <sys/time.h>
#include <sys/types.h>

// Ubuntu Dapper requires memory pages to be marked as
// executable. Otherwise, OS raises an exception when executing code
// in that page.
#include <errno.h>
#include <fcntl.h>      // open
#include <stdarg.h>
#include <strings.h>    // index
#undef index
#include <sys/mman.h>   // mmap & munmap
#include <sys/stat.h>   // open
#include <sys/types.h>  // mmap & munmap
#include <unistd.h>     // sysconf

// GLibc on ARM defines mcontext_t has a typedef for 'struct sigcontext'.
// Old versions of the C library <signal.h> didn't define the type.
#if defined(__ANDROID__) && !defined(__BIONIC_HAVE_UCONTEXT_T) && \
    (defined(__arm__) || defined(__aarch64__)) && \
    !defined(__BIONIC_HAVE_STRUCT_SIGCONTEXT)
#include <asm/sigcontext.h>  // NOLINT
#endif

#if defined(LEAK_SANITIZER)
#include <sanitizer/lsan_interface.h>
#endif

#include <cmath>

#undef MAP_TYPE

#include "src/base/macros.h"
#include "src/base/platform/platform.h"
#include "src/base/platform/platform-posix.h"
#include "src/s390/semaphore-zos.h"
#include "src/base/sys-info.h"

#include <mutex>
#include <unordered_map>

#define MAP_FAILED ((void *)-1L)

namespace v8 {
namespace base {


#ifdef __arm__

bool OS::ArmUsingHardFloat() {
  // GCC versions 4.6 and above define __ARM_PCS or __ARM_PCS_VFP to specify
  // the Floating Point ABI used (PCS stands for Procedure Call Standard).
  // We use these as well as a couple of other defines to statically determine
  // what FP ABI used.
  // GCC versions 4.4 and below don't support hard-fp.
  // GCC versions 4.5 may support hard-fp without defining __ARM_PCS or
  // __ARM_PCS_VFP.

#define GCC_VERSION (__GNUC__ * 10000                                          \
                     + __GNUC_MINOR__ * 100                                    \
                     + __GNUC_PATCHLEVEL__)
#if GCC_VERSION >= 40600
#if defined(__ARM_PCS_VFP)
  return true;
#else
  return false;
#endif

#elif GCC_VERSION < 40500
  return false;

#else
#if defined(__ARM_PCS_VFP)
  return true;
#elif defined(__ARM_PCS) || defined(__SOFTFP__) || defined(__SOFTFP) || \
      !defined(__VFP_FP__)
  return false;
#else
#error "\x59\x6f\x75\x72\x20\x76\x65\x72\x73\x69\x6f\x6e\x20\x6f\x66\x20\x47\x43\x43\x20\x64\x6f\x65\x73\x20\x6e\x6f\x74\x20\x72\x65\x70\x6f\x72\x74\x20\x74\x68\x65\x20\x46\x50\x20\x41\x42\x49\x20\x63\x6f\x6d\x70\x69\x6c\x65\x64\x20\x66\x6f\x72\x2e"          \
       "\x50\x6c\x65\x61\x73\x65\x20\x72\x65\x70\x6f\x72\x74\x20\x69\x74\x20\x6f\x6e\x20\x74\x68\x69\x73\x20\x69\x73\x73\x75\x65"                                        \
       "\x68\x74\x74\x70\x3a\x2f\x2f\x63\x6f\x64\x65\x2e\x67\x6f\x6f\x67\x6c\x65\x2e\x63\x6f\x6d\x2f\x70\x2f\x76\x38\x2f\x69\x73\x73\x75\x65\x73\x2f\x64\x65\x74\x61\x69\x6c\x3f\x69\x64\x3d\x32\x31\x34\x30"

#endif
#endif
#undef GCC_VERSION
}

#endif  // def __arm__


#define asm __asm__ volatile

static const int kMegaByte = 1024*1024;

//------------------------------------------accounting for memory allocation

#pragma convert("IBM-1047")

static int mem_account(void) {
  static int res = -1;
  if (-1 == res) {
    res = 0;
    char *ma = getenv("__MEM_ACCOUNT");
    if (ma && 0 == strcmp("1", ma)) {
      res = 1;
    }
  }
  return res;
}

static int gettcbtoken(char *out, int type) {
  typedef struct token_parm {
    char token[16];
    char *__ptr32 ascb;
    char type;
    char reserved[3];
  } token_parm_t;
  token_parm_t *tt = (token_parm_t *)__malloc31(sizeof(token_parm_t));
  memset(tt, 0, sizeof(token_parm_t));
  tt->type = type;
  long workreg;
  __asm(" L %0,16(0,0) \n"
        " L %0,772(%0,0) \n"
        " L %0,212(%0,0) \n"
        " PC 0(%0) \n"
        : "=NR:r15"(workreg) // also return code
        : "NR:r1"(tt)
        : );
  memcpy(out, (char *)tt, 16);
  free(tt);
  return workreg;
}

struct iarv64parm {
  unsigned char xversion __attribute__((__aligned__(16))); //    0
  unsigned char xrequest;                                  //    1
  unsigned xmotknsource_system : 1;                        //    2
  unsigned xmotkncreator_system : 1;                       //    2(1)
  unsigned xmatch_motoken : 1;                             //    2(2)
  unsigned xflags0_rsvd1 : 5;                              //    2(3)
  unsigned char xkey;                                      //    3
  unsigned keyused_key : 1;                                //    4
  unsigned keyused_usertkn : 1;                            //    4(1)
  unsigned keyused_ttoken : 1;                             //    4(2)
  unsigned keyused_convertstart : 1;                       //    4(3)
  unsigned keyused_guardsize64 : 1;                        //    4(4)
  unsigned keyused_convertsize64 : 1;                      //    4(5)
  unsigned keyused_motkn : 1;                              //    4(6)
  unsigned keyused_ownerjobname : 1;                       //    4(7)
  unsigned xcond_yes : 1;                                  //    5
  unsigned xfprot_no : 1;                                  //    5(1)
  unsigned xcontrol_auth : 1;                              //    5(2)
  unsigned xguardloc_high : 1;                             //    5(3)
  unsigned xchangeaccess_global : 1;                       //    5(4)
  unsigned xpageframesize_1meg : 1;                        //    5(5)
  unsigned xpageframesize_max : 1;                         //    5(6)
  unsigned xpageframesize_all : 1;                         //    5(7)
  unsigned xmatch_usertoken : 1;                           //    6
  unsigned xaffinity_system : 1;                           //    6(1)
  unsigned xuse2gto32g_yes : 1;                            //    6(2)
  unsigned xowner_no : 1;                                  //    6(3)
  unsigned xv64select_no : 1;                              //    6(4)
  unsigned xsvcdumprgn_no : 1;                             //    6(5)
  unsigned xv64shared_no : 1;                              //    6(6)
  unsigned xsvcdumprgn_all : 1;                            //    6(7)
  unsigned xlong_no : 1;                                   //    7
  unsigned xclear_no : 1;                                  //    7(1)
  unsigned xview_readonly : 1;                             //    7(2)
  unsigned xview_sharedwrite : 1;                          //    7(3)
  unsigned xview_hidden : 1;                               //    7(4)
  unsigned xconvert_toguard : 1;                           //    7(5)
  unsigned xconvert_fromguard : 1;                         //    7(6)
  unsigned xkeepreal_no : 1;                               //    7(7)
  unsigned long long xsegments;                            //    8
  unsigned char xttoken[16];                               //   16
  unsigned long long xusertkn;                             //   32
  void *xorigin;                                           //   40
  void *xranglist;                                         //   48
  void *xmemobjstart;                                      //   56
  unsigned xguardsize;                                     //   64
  unsigned xconvertsize;                                   //   68
  unsigned xaletvalue;                                     //   72
  int xnumrange;                                           //   76
  void *__ptr32 xv64listptr;                               //   80
  unsigned xv64listlength;                                 //   84
  unsigned long long xconvertstart;                        //   88
  unsigned long long xconvertsize64;                       //   96
  unsigned long long xguardsize64;                         //  104
  char xusertoken[8];                                      //  112
  unsigned char xdumppriority;                             //  120
  unsigned xdumpprotocol_yes : 1;                          //  121
  unsigned xorder_dumppriority : 1;                        //  121(1)
  unsigned xtype_pageable : 1;                             //  121(2)
  unsigned xtype_dref : 1;                                 //  121(3)
  unsigned xownercom_home : 1;                             //  121(4)
  unsigned xownercom_primary : 1;                          //  121(5)
  unsigned xownercom_system : 1;                           //  121(6)
  unsigned xownercom_byasid : 1;                           //  121(7)
  unsigned xv64common_no : 1;                              //  122
  unsigned xmemlimit_no : 1;                               //  122(1)
  unsigned xdetachfixed_yes : 1;                           //  122(2)
  unsigned xdoauthchecks_yes : 1;                          //  122(3)
  unsigned xlocalsysarea_yes : 1;                          //  122(4)
  unsigned xamountsize_4k : 1;                             //  122(5)
  unsigned xamountsize_1meg : 1;                           //  122(6)
  unsigned xmemlimit_cond : 1;                             //  122(7)
  unsigned keyused_dump : 1;                               //  123
  unsigned keyused_optionvalue : 1;                        //  123(1)
  unsigned keyused_svcdumprgn : 1;                         //  123(2)
  unsigned xattribute_defs : 1;                            //  123(3)
  unsigned xattribute_ownergone : 1;                       //  123(4)
  unsigned xattribute_notownergone : 1;                    //  123(5)
  unsigned xtrackinfo_yes : 1;                             //  123(6)
  unsigned xunlocked_yes : 1;                              //  123(7)
  unsigned char xdump;                                     //  124
  unsigned xpageframesize_pageable1meg : 1;                //  125
  unsigned xpageframesize_dref1meg : 1;                    //  125(1)
  unsigned xsadmp_yes : 1;                                 //  125(2)
  unsigned xsadmp_no : 1;                                  //  125(3)
  unsigned xuse2gto64g_yes : 1;                            //  125(4)
  unsigned xdiscardpages_yes : 1;                          //  125(5)
  unsigned xexecutable_yes : 1;                            //  125(6)
  unsigned xexecutable_no : 1;                             //  125(7)
  unsigned short xownerasid;                               //  126
  unsigned char xoptionvalue;                              //  128
  unsigned char xrsv0001[8];                               //  129
  unsigned char xownerjobname[8];                          //  137
  unsigned char xrsv0004[7];                               //  145
  void *xdmapagetable;                                     //  152
  unsigned long long xunits;                               //  160
  unsigned keyused_units : 1;                              //  168
  unsigned xunitsize_1m : 1;                               //  168(1)
  unsigned xunitsize_2g : 1;                               //  168(2)
  unsigned xpageframesize_1m : 1;                          //  168(3)
  unsigned xpageframesize_2g : 1;                          //  168(4)
  unsigned xtype_fixed : 1;                                //  168(5)
  unsigned xflags9_rsvd1 : 2;                              //  168(6)
  unsigned char xrsv0005[7];                               //  169
};
static long long __iarv64(void *parm, void **ptr, long long *reason_code_ptr) {
  long long rc;
  long long reason;
  __asm volatile(" lgr 1,%3 \n"
                 " llgtr 14,14 \n"
                 " l 14,16(0,0) \n"
                 " l 14,772(14,0) \n"
                 " l 14,208(14,0) \n"
                 " la 15,14 \n"
                 " or 14,15 \n"
                 " pc 0(14) \n"
                 " stg 1,%0 \n"
                 " stg 15,%1 \n"
                 " stg 0,%2 \n"
                 : "=m"(*ptr), "=m"(rc), "=m"(reason)
                 : "r"(parm)
                 : "r0", "r1", "r14", "r15");
  if (rc != 0 && reason_code_ptr != 0) {
    *reason_code_ptr = reason;
  }
  return rc;
}

static void *__iarv64_alloc(int segs, const char *token) {
  void *ptr = 0;
  long long rc, reason;
  struct iarv64parm parm __attribute__((__aligned__(16)));
  memset(&parm, 0, sizeof(parm));
  parm.xversion = 5;
